package main

import (
	"fmt"
	"gopkg.in/yaml.v3"
	"os"
	"regexp"
	"strconv"
)

var Coc7DefaultAttrs = map[string]int64{}
var cocDefaultAttrText = `
会计			5
人类学			1
估价			5
考古学			1
取悦			15
攀爬			20
计算机使用			5
信用评级			0
克苏鲁神话			0
乔装			5
汽车驾驶			20
电气维修			10
电子学			1
话术			5
急救			30
历史			5
恐吓			15
跳跃			20
法律		5
图书馆使用		20
聆听		20
锁匠		1
机械维修		10
医学		1
博物学		10
导航		10
神秘学		5
操作重型机械		1
说服		10
精神分析		1
心理学		10
骑术		5
妙手		10
侦查		25
潜行		20
游泳		20
投掷		20
追踪		10
动物驯养		5
潜水		1
爆破		1
读唇		1
催眠		1
炮术		1
学识		1
艺术与手艺		5
表演		5
美术		5
伪造		5
摄影		5
理发		5
书法		5
木匠		5
厨艺		5
舞蹈		5
写作		5
莫里斯舞蹈		5
歌剧歌唱		5
粉刷匠和油漆工		5
制陶		5
雕塑		5
吹真空管		5
技术制图		5
裁缝		5
声乐		5
喜剧		5
耕作		5
器乐		5
打字		5
速记		5
园艺		5
斗殴		25
剑		20
日本刀		20
斧		15
链锯		10
连枷		10
绞索		15
鞭		5
手枪		20
霰弹枪		25
弓		15
火焰喷射器		10
重武器		10
机枪		10
矛		20
冲锋枪		15
天文学		1
生物学		1
植物学		1
化学		1
密码学		1
工程学		1
司法科学		1
地质学		1
数学		10
气象学		1
药学		1
物理学		1
动物学		1
船		1
飞行器		1
科学		1
生存		10
沙漠		10
海洋		10
极地		10
语言		1
`

func main() {
	reCocDefaultAttr := regexp.MustCompile(`(\S+)\s+(\d+)`)
	m := reCocDefaultAttr.FindAllStringSubmatch(cocDefaultAttrText, -1)
	for _, i := range m {
		n, _ := strconv.ParseInt(i[2], 10, 64)
		Coc7DefaultAttrs[i[1]] = n
	}

	defaultVals := CharacterTemplate{
		KeyName:           "coc7",
		FullName:          "克苏鲁的呼唤第七版",
		Version:           "1.0.0",
		UpdatedTime:       "20230212",
		Authors:           []string{"木落", "月森优姬", "于言诺"},
		NameTemplateKeys:  []string{"coc", "coc7"},
		NameTemplateValue: "{$t玩家_RAW} SAN{理智} HP{生命值}/{生命值上限} DEX{敏捷}",

		Defaults: Coc7DefaultAttrs,
		DefaultsComputed: map[string]string{
			"闪避":    "敏捷 / 2",
			"母语":    "教育",
			"语言":    "教育",
			"生命值上限": "(体质 + 体型) / 10",
			"db":    "{(力量 + 体型) < 65 ? -2, (力量 + 体型) < 85 ? -1, (力量 + 体型) < 125 ? 0, (力量 + 体型) < 165 ? 1d14, (力量 + 体型) < 205 ? 1d6, 1 ? ((力量 + 体型 - 205) / 80 + 2)d6 }",
		},

		Alias: map[string][]string{
			"理智": {"san", "san值", "理智值", "理智点数", "心智", "心智点数", "心智點數", "理智點數"},
			"力量": {"str"},
			"体质": {"con", "體質"},
			"体型": {"siz", "體型", "体形", "體形"},
			"敏捷": {"dex"},
			"外貌": {"app", "外表"},
			"意志": {"pow"},
			"教育": {"edu", "知识", "知識"}, // 教育和知识等值而不是一回事，注意
			"智力": {"int", "灵感", "靈感"}, // 智力和灵感等值而不是一回事，注意
			"db": {"DB", "伤害加值"},

			"幸运":     {"luck", "幸运值", "运气", "幸運", "運氣", "幸運值"},
			"生命值":    {"hp", "生命", "体力", "體力", "血量", "耐久值"},
			"生命值上限":  {"hpmax", "生命上限", "体力上限", "體力上限", "血量上限", "耐久值上限"},
			"魔法值":    {"mp", "魔法", "魔力", "魔力值"},
			"魔法值上限":  {"mpmax", "魔法上限", "蓝量上限", "藍量上限"},
			"护甲":     {"装甲", "護甲", "裝甲"},
			"枪械":     {"火器", "射击", "槍械", "射擊"},
			"会计":     {"會計"},
			"人类学":    {"人類學"},
			"估价":     {"估價"},
			"考古学":    {"考古學"},
			"取悦":     {"魅惑", "取悅"},
			"攀爬":     {"攀岩", "攀登"},
			"计算机使用":  {"电脑使用", "計算機使用", "電腦使用", "计算机", "电脑", "計算機", "電腦"},
			"信用评级":   {"信誉", "信用", "信誉度", "cr", "信用評級", "信譽", "信譽度"},
			"克苏鲁神话":  {"cm", "克苏鲁", "克苏鲁神话知识", "克蘇魯", "克蘇魯神話", "克蘇魯神話知識"},
			"乔装":     {"喬裝"},
			"闪避":     {"閃避"},
			"汽车驾驶":   {"汽車駕駛", "汽车", "驾驶", "汽車", "駕駛"},
			"电气维修":   {"电器维修", "电工", "電氣維修", "電器維修", "電工"},
			"电子学":    {"電子學"},
			"话术":     {"快速交谈", "話術", "快速交談"},
			"历史":     {"歷史"},
			"恐吓":     {"恐嚇"},
			"跳跃":     {"跳躍"},
			"母语":     {"母語"},
			"图书馆使用":  {"圖書館使用", "图书馆", "图书馆利用", "圖書館", "圖書館利用"},
			"聆听":     {"聆聽"},
			"锁匠":     {"开锁", "撬锁", "钳工", "鎖匠", "鉗工", "開鎖", "撬鎖"},
			"机械维修":   {"机器维修", "机修", "機器維修", "機修", "機械維修"},
			"医学":     {"醫學"},
			"博物学":    {"自然", "自然学", "自然史", "自然學", "博物學"},
			"导航":     {"领航", "領航", "導航"},
			"神秘学":    {"神秘學"},
			"操作重型机械": {"重型操作", "重型机械", "重型", "重机", "操作重型機械", "重型機械", "重機"},
			"说服":     {"辩论", "议价", "演讲", "說服", "辯論", "議價", "演講"},
			"精神分析":   {"心理分析"},
			"心理学":    {"心理學"},
			"骑术":     {"騎術"},
			"妙手":     {"藏匿", "盗窃", "盜竊"},
			"侦查":     {"侦察", "偵查", "偵察"},
			"潜行":     {"躲藏", "潛行"},
			"投掷":     {"投擲"},
			"追踪":     {"跟踪", "追蹤", "跟蹤"},
			"动物驯养":   {"驯养", "驯兽", "馴獸", "動物馴養", "馴養"},
			"读唇":     {"唇语", "讀唇", "唇語"},
			"炮术":     {"炮術"},
			"学识":     {"学问", "學識", "學問"},
			"艺术与手艺":  {"艺术和手艺", "艺术", "手艺", "工艺", "技艺", "藝術與手藝", "藝術和手藝", "藝術", "手藝", "工藝", "技藝"},
			"美术":     {"美術"},
			"伪造":     {"偽造"},
			"摄影":     {"攝影"},
			"理发":     {"理髮"},
			"书法":     {"書法"},
			"木匠":     {"木工"},
			"厨艺":     {"烹饪", "廚藝", "烹飪"},
			"写作":     {"文学", "寫作", "文學"},
			"歌剧歌唱":   {"歌劇歌唱"},
			"技术制图":   {"技術製圖"},
			"裁缝":     {"裁縫"},
			"声乐":     {"聲樂"},
			"喜剧":     {"喜劇"},
			"器乐":     {"器樂"},
			"速记":     {"速記"},
			"园艺":     {"園藝"},
			"斗殴":     {"鬥毆"},
			"剑":      {"剑术", "劍", "劍術"},
			"斧":      {"斧头", "斧子", "斧頭"},
			"链锯":     {"电锯", "油锯", "鏈鋸", "電鋸", "油鋸"},
			"链枷":     {"连枷", "連枷", "鏈枷"},
			"绞索":     {"绞具", "絞索", "絞具"},
			"手枪":     {"手槍"},
			"霰弹枪":    {"步枪", "步霰", "步枪/霰弹枪", "散弹枪", "步槍", "霰彈槍", "步霰", "步槍/霰彈槍", "散彈槍"},
			"弓":      {"弓术", "弓箭", "弓術"},
			"火焰喷射器":  {"火焰噴射器"},
			"机枪":     {"機槍"},
			"矛":      {"投矛"},
			"冲锋枪":    {"衝鋒槍"},
			"天文学":    {"天文學"},
			"生物学":    {"生物學"},
			"植物学":    {"植物學"},
			"化学":     {"化學"},
			"密码学":    {"密碼學"},
			"工程学":    {"工程學"},
			"司法科学":   {"司法科學"},
			"地质学":    {"地理学", "地質學", "地理學"},
			"数学":     {"數學"},
			"气象学":    {"氣象學"},
			"药学":     {"藥學"},
			"物理":     {"物理学", "物理學"},
			"动物学":    {"動物學"},
			"船":      {"开船", "驾驶船", "開船", "駕駛船"},
			"飞行器":    {"开飞行器", "驾驶飞行器", "飛行器", "開飛行器", "駕駛飛行器"},
			"科学":     {"科學"},
			"海洋":     {"海上"},
			"极地":     {"極地"},
			"语言":     {"外语", "語言", "外語"},
			"潜水":     {"潛水"},
		},

		ShowSettings: ShowSettings{
			Top:     []string{"力量", "敏捷", "体质", "体型", "外貌", "智力", "意志", "教育", "理智", "db", "克苏鲁神话", "生命值", "魔法值"},
			SortBy:  "name",
			Ignores: []string{"生命值上限"},
			ShowAs: map[string]string{
				"生命值": "{生命值}/{生命值上限}",
				"魔法值": "{魔法值}/{魔法值上限}",
				"db":  "{ (力量 + 体型) < 65 ? '-2', (力量 + 体型) < 85 ? '-1', (力量 + 体型) < 125 ? '0', (力量 + 体型) < 165 ? '1d4', (力量 + 体型) < 205 ? '1d6', 1 ? `{((力量 + 体型 - 205) / 80 + 2)}d6` }",
			},
		},

		Texts: &TextTemplateWithWeightDict{
			"COC": {
				"设置测试_成功": {
					{"设置完成", 1},
				},
			},
		},
	}

	buf, err := yaml.Marshal(defaultVals)
	if err != nil {
		fmt.Println(err)
	} else {
		os.WriteFile("./coc7角色卡模板.yaml", buf, 0644)
	}
}
